[Language]
Code="ar"
Name="عربية"
Translator="Abdulmajeed"
Dir="rtl"

[MainFrame]
Title="Lingoes"
Close="إغلاق"
Maximize="تكبير"
Minimize="تصغير"
Restore="إستعادة"
Menu="القائمة الرئيسية"

; Status Icon
[NotifyIcon]
Tip="مترجم Lingoes\nإلتقاط كلمة على الشاشة: [$CursorStatus]\nترجمة نص مظلل: [$SelectionStatus]\nترجمة نص في الحافظة: [$ClipboardStatus]"
InfoTitle="Lingoes مترجم"
Info="إلتقاط كلمة على الشاشة:\t[$CursorStatus]\nترجمة نص مظلل:\t[$SelectionStatus]\nترجمة نص في الحافظة:\t[$ClipboardStatus]"
Enabled="مُمكّنة"
Disabled="مُعطّلة"

[MainMenu]
Open="فتح"
CursorTranslator="إلتقاط كلمة على الشاشة"
SelectionTranslator="ترجمة نص مظلل"
ClipboardTranslator="ترجمة نص في الحافظة"
Configuration="الإعدادات..."
Dictionaries="القواميس..."
Activation="تنشيط المنتَج"
UpdateOnline="التحديث عن طريق الإنترنت"
Help="تعليمات"
About="عن Lingoes"
SupportOnline="الدعم عن طريق الإنترنت"
Exit="خروج"

[DlgInput]
Back="السابق"
Forward="التالي"
MainMenu="القائمة الرئيسية"
HistoryList="قائمة المحفوظات"
Search="بحث", "بحث دقيق للمعاني"
WebSearch="بحث على ويب"
AutoMatch="مطابقة تلقائية", "مطابقة تلقائية لقواميس الفهرس"
MatchSetup="خيارات قواميس الفهرس..."
FindEngine="الحصول على المزيد من محركات ويب..."

[DlgIndex]
Index="الفهرس"
Guide="الدليل"
Appendix="الملحق"
NoIndex="لا توجد فهرسة"
AddIndexGroup="<div style=\"margin: 10; font-family: '[$TextFont]'; font-size: [$TextFontSize]pt\">إضافة القاموس إلى <b>قواميس الفهرس</b>, بإمكانك الحصول على إقتراح لتهجئة الكلمة أثناء إدخالها.<br/><br/><a href=\"app://dictionary_group/[$IndexGroupID]\"><u>لإدارة قواميس الفهرس، أنقر هنا.</u></a></div>"

[WebGuide]
Results="النتائج"
Spelling="بدائل التهجئة"
Appendices="ملاحق"
Options="خيارات"
Dictionaries="القواميس...", "إدارة القواميس"
Configuration="الإعدادات...", "فتح نافذة الإعدادات"
Help="التعليمات", "فتح تعليمات Lingoes"
Homepage="lingoes.net", "زيارة موقع Lingoes على ويب"
Community="Lingoes منتديات", "منتديات Lingoes على الإنترنت"

[DlgStatus]
KeepVisible="إبقاء النافذة دوما في المقدمة"

[DlgView]
Speak="النُّطق", "نُطق النص المحدد"
Search="بحث"
Copy="نسخ"
Print="طباعة..."
Save="حفظ..."
Find="بحث..."
SelectAll="تحديد الكل"
TextTranslate="ترجمة", "تشغيل ترجمة النصوص"
StartPage="", "صفحة البداية"
ShowIndex="إظهار الشريط الجانبي"
HideIndex="إخفاء الشريط الجانبي"
SaveFilter="HTML ملف (*.htm; *.html)|*.htm;*.html|"
SpeechOption="خيارات الكلام..."
SelectVoice="إختيار الصوت"
Activation="التنشيط", "Lingoes معالج تنشيط"

[DlgRegister]
Title="Lingoes - التسجيل للإستخدام التجاري"
FreeDownload="Lingoes مجاني للإستخدام في الأغراض الغير تجارية.\r\nتحميل الإصدار المجاني من هنا..."
Name="إسم التسجيل:", "الإسم ضروري للتسجيل"
Email="البريد الإلكتروني للتسجيل:", "البريد الإلكتروني ضروري للتسجيل"
RegCode="مفتاح التسجيل:", "مفتاح التسجيل غير صالح"
Support="خدمة العملاء"
Register="تسجيل", "حفظ معلومات التسجيل الفاشلة"
Exit="خروج"

[DlgInfo]
Title="رسالة"
Ok="موافق"
Cancel="إلغاء الأمر"
Yes="نعم"
No="لا"
Retry="إعادة"
Abort="إلغاء"
Ignore="تجاهل"

[DlgAuthentication]
Title="الإتصال بـ "
TitleProxy="الإتصال بملقم الوكيل "
Username="إسم المستخدم:"
Password="كلمة المرور:"
Remember="تذكّر كلمة المرور"
Ok="موافق"
Cancel="إلغاء الأمر"

[WndGrab]
Open="بحث دقيق للمعاني"
Speak="النُّطق"
Copy="نسخ"
TextTranslation="ترجمة نص"
KeepSize="الحفاظ على حجم النافذة"
KeepVisible="إبقاء النافذة دوما في المقدمة"
Back="السابق" 
Forward="التالي"
Search="بحث\n  Enter:\t\tبحث\n  Ctrl + Enter:\tبحث دقيق للمعاني\n  Shift + Enter:\tترجمة نص\n  Alt + Enter:\tبحث عبى ويب"

[DlgDictOption]
Title="خيارات القاموس"
NetInstall="تثبيت من Lingoes", "تثبيت قاموس من موقع Lingoes"
Install="تثبيت", "تثبيت قاموس من القرص"
Uninstall="إلغاء تثبيت", "إلغاء تثبيت القاموس"
Add="إضافة", "إضافة قاموس إلى اللائحة"
Remove="إزالة", "إزالة هذا القاموس من اللائحة"
Download="تحميل", "تحميل هذا القاموس للإستخدام بدون إتصال"
MoveTop="", "تحريك إلى القمّة"
MoveUp="", "تحريك لأعلى"
MoveDown="", "تحريك لأسفل"
MoveBottom="", "تحريك إلى القاع"
MoreDetails="", "عرض تفاصيل القاموس"
Close="إغلاق"

Installed="القواميس المثبَّتة"
Query="القواميس المثبَّتة"
Index="قواميس الفهرس"
Grab="قواميس إلتقاط النص"

InstalledList="القواميس المثبَّتة"
QueryList="القواميس المثبَّتة"
IndexList="لائحة قواميس الفهرس"
GrabList="لائحة قواميس إلتقاط النص"
DictID="ID"
Online="الإتصال"

Type="النوع"
OnlineType="يتطلب إتصالاً بالإنترنت"
AddFilter="Lingoes قواميس (*.ld2, *.ldp)|*.ld2;*.ldp|"
InstallDict="تثبيت قاموس"
Installing="جاري التثبيت..."

[DlgDictList]
Title="إضافة قواميس"
Add="إضافة"
Cancel="إلغاء الأمر"
Select="تحديد"
DictList="القواميس المثبَّتة"
ID="ID"
Online="الإتصال"

[DlgDictInfo]
Title="تفاصيل القاموس"
Close="موافق"

ID="ID"
MD5="MD5"
Name="الإسم"
Version="الإصدار"
Date="تاريخ الإنتاج"
Update="آخر تحديث"
IndexCount="مجموع الكلمات"
Language=اللغة
MoreLanguage=أكثر..
DictTitle="العنوان"
DictEdition="النُّسخة"
DictDescription="الوصف"
PubAuthor="المؤلف"
PubEmail="البريد الإلكتروني"
PubWebsite="الموقع على ويب"
PubCopyright="حقوق النشر"
Filename="إسم الملف"

; Install Dictionaries
[DlgDictInstall]
Title="تثبيت قاموس"
InstallSucceed="تم تثبيت القاموس \"[$DictTitle]\" بنجاح"
DictGroupOption="خيارات"
AddIndexGroup="إضافة إلى \"قواميس الفهرس\""
AddIndexGroupDesc="سيقوم Lingoes بالبحث في قواميس الفهرس والتوجيه إلى أقرب نتيجة في شريط الفهرس بينما يتم إدخال الكلمة."
AddGrabGroup="إضافة إلى \"قواميس إلتقاط النص\""
AddGrabGroupDesc="سيقوم Lingoes بالبحث في قواميس إلتقاط النص ويعرض نتيجة الترجمة في نافذة إلتقاط النص بينما يتم إلتقاط النص."
Ok="موافق"

; Configuration
[DlgOption]
Title="الإعدادات"
Ok="موافق"
Cancel="إلغاء الأمر"
General="عام"
Appearance="المظهر"
Connection="الإتصال"
Speech="الكلام"
Hotkey="إختصارات"
Translate="الترجمة"
License="التراخيص"
Capture="إلتقاط النص"

; General
[DlgOptGeneral]
Language="اللغة"
UILanguage="لغة واجهة المستخدم"

WebSearch="بحث على ويب"
SelectWebSearch="إختيار محرك بحث لإستخدامه في البحث على ويب"

TermHistory="المحفوظات والتخزين المؤقَّت"
SaveHistory="الكلمات التي سيتم تخزينها في المحفوظات"
ClearHistory="مسح المحفوظات"
ClearHistoryConfirmation="هل تود بالفعل مسح المحفوظات؟"

ResultCache="التخزين المؤقت لقواميس الإنترنت"
ClearCache="مسح المخزَن المؤقَّت", "هل تود بالفعل مسح المخزَن المؤقَّت؟"

AutoStart="تشغيل Lingoes عند تسجيل الدخول إلى ويندوز"
StartMin="تصغير بعد بدأ التشغيل"

; Appearance
[DlgOptAppearance]
UserInterface="واجهة المستخدم"
WindowStyle="نمط النافذة"
WindowFont="خط النافذة"
WindowFontSize="حجم الخط"
WindowFontSizeList="7", "8", "9", "10", "10.5", "11"
ResultDisplay="عرض النتيجة"
TextFont="خط النص"
TextFontSize="حجم الخط"
TextFontSizeList="7", "8", "9", "10", "10.5", "11", "12", "13", "14", "16", "18", "20", "22", "24", "26", "28", "32", "36", "48"
PhoneticFont="الخط اللفظي"
CursorTranslatorBar="نافذة إلتقاط النص"
FontColor="لون الخط"
BackColor="لون الخلفية"
BorderColor="لون الحدود"
Transparence="نوافذ شبه شفافة لإلتقاط النص"
SampleText="إلتقاط النص"

[Style]
0="بلا"
1="النمط الإفتراضي"

; Translate
[DlgOptTranslate]
SupportLCMap="دعم المطابقة للغة المحلية"
InstantTranslation="ترجمة فورية"
TargetLanguage="اللغة الهدف:"
CurrentUserLanguage="= لغة المستخدم الحالية"
TargetLanguage2="إذا كانت اللغة الهدف مماثلة للمصدر، أعد الضبط إلى:"
NoTranslate="= بدون ترجمة"

; Capture
[DlgOptCapture]
CursorActivation="إلتقاط كلمة على الشاشة"
MouseActivation="وضعية تنشيط الفأرة:"
MouseOver="المرور بالفأرة"
LeftMouseButton="زر الفأرة الأيسر"
MiddleMouseButton="زر الفأرة الأوسط"
RightMouseButton="زر الفأرة الأيمن"
MouseXButton1="الفأرة X الزر 1"
MouseXButton2="الفأرة X الزر 2"
TimeDelay="مدة التأخير:"
MSEL="ملي ثانية"
IgnoreNumber="تجاهل الأرقام"
IgnoreLatin="تجاهل اللاتينية (الإنجليزية، الفرنسية، الألمانية، الأسبانية، إلخ)"
IgnoreCJK="تجاهل الصينية واليابانية والكورية"
IgnoreCyrillic="تجاهل السيريلية (الروسية، الأوكرانية، البلغارية، إلخ)"
IgnoreArabic="تجاهل العربية والعبرية"
InstallAdobePlugin="تثبيت إضافة Adobe Acrobat PDF"
ZonedWord="ترجمة النص المظلل"
ZonedWordFilterRule="قواعد فلتر تحديد النص..."
ShowOnlyFirstResult="عرض أول نتيجة للبحث فقط"

; Capture - Zoned Word Filter
[DlgOptTranslateZWFilter]
Title="قواعد فلتر تحديد النص"
ProgramFilename="إسم ملف البرنامج", "إسم ملف البرنامج (تعيين الكل إذا كان فارغ)"
WndClassName="إسم Class النافذة", "إسم Class النافذة (تعيين الكل إذا كان فارغ)"
DisableSelect="تجاهل التحديد", "تجاهل التحديد"
DisableDBLClick="تجاهل النقر المزدوج", "تجاهل النقر المزدوج"
Comment="Comment", "تعليق"
Add="إضافة"
Modify="تعديل"
Delete="حذف", "هل تود بالفعل حذف العنصر الحالي؟"
Ok="موافق"
Cancel="إلغاء الأمر"
LoadDefault="الإفتراضي", "هل تود بالفعل إستعادة الإعدادات الإفتراضية؟"
Browser="...", "المستعرض", "برنامج (*.exe)|*.exe|"
Capture="...", "إلتقاط إسم Class النافذة"
AllProgram="-- كل البرامج --"
AllWindow="-- كل النوافذ --"

[WndClassNameCapture]
Title="إلتقاط إسم Class النافذة"
ProgramFilename="إسم ملف البرنامج"
WndClassName="إسم Class النافذة"
Capture="إلتقاط من الشاشة"

; Speech
[DlgOptSpeech]
RPPEngine="محرك الصوت الطبيعي"
RPPEnable="تمكين"
RPPVoice="الصوت"
RPPRebuildIndexFile="إعادة بناء ملف الفهرسة", "إعادة بناء ملف الفهرسة فشلت! \nربما حدث ذلك لأنك لاتملك صلاحيات للوصول إلى الملف."
Engine="محرك صوت إلى كلام (TTS)"
Voice="الصوت"
Enable="تمكين"
Volume="الحجم"
Pitch="الحدّة"
Speed="السرعة"
RealtimePron="اللفظ في الوقت الحقيقي"
PronInQuery="أثناء البحث عن كلمة"
PronInCapture="أثناء إلتقاط نص"
Test="إختبار"
EnterText="أدخل نصاً لتجربته بهذا الصوت"
DownloadTTS="تحميل حزم صوتية لمحركات الصوت الطبيعي ومحركات نص إلى كلام..."

; Connect
[DlgOptConnection]
ConnectSet="إعدادات الإتصال"
DirectConnect="إتصال مباشر"
IEProxyConnect="إستخدام إعدادات ملقم وكيل من متصفح الإنترنت"
ProxyConnect="إتصال من خلال ملقم وكيل / جدار ناري"
ProxyServer="ملقم الوكيل:"
ProxyPort="المنفذ:"
Username="إسم المستخدم:"
Password="كلمة المرور:"
OnlineUpdate="تحديث عن طريق الإنترنت"
UpdateNow="التحديث الآن"
EnableUpdate="تمكين التحديث عن طريق الإنترنت"

; Hotkey
[DlgOptHotkey]
OpenMainWnd="فتح النافذة الرئيسية"
GrabToggleKey="مفتاح تمكين وتعطيل إلتقاط كلمة على الشاشة"
SelectionToggleKey="مفتاح تمكين وتعطيل ترجمة النص المحدد"
ClipboardToggleKey="مفتاح تمكين وتعطيل ترجمة نص في الحافظة"
Pronounce="اللفظ"
CopyInterpretation="نسخ المحتويات عند الترجمة"

[DlgExpire]
Title="إنتهت فترة صلاحية Lingoes"
Ok="الترقية الآن"
Cancel="خروج"
NetworkSettings="إعدادات الشبكة"
Support="Lingoes.net"
AskUpgrade="إنتهت فترة صلاحية الإصدار الحالي، لابد من الترقية إلى إصدار جديد! \nهل  تود الترقية إلى الإصدار الجديد؟"

[DlgAbout]
DlgTitle="عن Lingoes"
Version="الإصدار: "
PortableEdition="نسخة محمولة"
Email="عنوان البريد الإلكتروني"
Website="موقع Lingoes على ويب"
LicenseTo="هذا المنتَج مرخص لـ:"
LicenseID="ID: "

[WebResult]
SpellingAlternatives="بدائل التهجئة"
SpellChecker="فاحص التهجئة"
TextTranslation="ترجمة نص"
WebSearch="بحث على ويب"
MoreResults="نتائج أكثر"
WaitSearch="جاري طلب نتائج البحث..."
NoMatch="<div id='dict_result_nomatch' style=\"font-family:'[$TextFont]'; font-size:[$TextFontSize]pt; line-height:normal; padding:10; display:[$Display]\"><b>لا تطابق وجد لـ \"<font color='#C00000'>[$SearchKey]</font>\".</b></div>"

[WebStartPage]
StartPageTpl="<table id='startpage' width='100%' height='100%' border='0' cellspacing='0' cellpadding='10' onselectstart='return false'><tr><td align='center' style=\"font-family: '[$Font]'; font-size: [$FontSize]pt; line-height: 1.2em\"><a href='app://homepage/'><img border='0' src='[$ImgPath]logomain.png' width='134' height='40' style='margin-bottom:50'></a></td></tr></table>"
HelpTip="كيفية إستخدام Lingoes"
DownDictTip="تحميل قواميس أكثر"
Intro="دعم الرتجمة لأكثر من 80 لغة بشكل تبادلي<br>ترجمة مؤشر الفأرة وترجمة النص ونص إلى كتابة"

[TextTranslation]
Title="ترجمة نص"
To="إلى"
Translate="ترجمة"
RequestFailed="خدمات طلب الترجمة فشلت."
ConnectFailed="فشل Lingoes في الإتصال بالسيرفر. إذا كنت متصلا بالإنترنت، فالرجاء فحص إعداد الإتصال في الإعدادات. "
WaitRequest="جاري طلب نتائج الترجمة..."
ParseResultFailed="فشَل في تحليل نتيجة البحث. إن تكررت الرسالة عدة مرات، فالرجاء إرسال تقرير لنا بذلك."

; Layout
[Layout]
DictMenu="قائمة القاموس"
ShowResult="عرض النتيجة"
MinimizeResult="تصغير النتيجة"
FindWord="بحث: "

; Dictionary Menu
[DictMenu]
About="عن..."
Enable="تمكين"
Disable="تعطيل"
DisableMsg="القاموس معَّطل ولن يعرض نتائج\nبإستطاعتك تمكينه من خلال نافذة /"القواميس/"."
MoveTop="ضبط كأعلى نتيجة"
ArrangeResults="ترتيب النتائج..."
IndexGroup="  (قواميس الفهرس)"
QueryGroup="  (قواميس الإستعلام)"
GrabGroup="  (قواميس إلتقاط النص)"

[Update]
Title="تحديث عن طريق الإنترنت"
AskUpgrade="تم الكشف عن إصدار جديد. هل تود التحديث إلى الإصدار الجديد؟"
UpgradeNow="تم الكشف عن إصدار جديد. يجب التحديث إلى الإصدار الجديد"
UpdateSuccess="تم التحديث بنجاح!"
UpdateFail="فشل في التحديث!"
NoUpdate="الإصدار الذي يعمل حالياً هو الإصدار الأخير"

CheckUpdate="Checking update..."
GetUpdateInfo="Getting updated information..."
DownUpdateData="Downloading updated data..."
ExecUpdate="Updating system..."
GetUpgradeInfo="Getting upgraded information..."
DownUpgradeData="Downloading upgraded data..."
ExecUpgrade="Upgrading system..."
NeedExitForUpgrade="Lingoes will quit for finishing upgrade"

[Message]
InitUpdateServerFail="فشل في بدء تشغيل خدمة التحديث التلقائي "
StartDictServerFail="فشل في بدء تشغيل خدمة القاموس."

DictFileErr="هيئة الملف غير صحيحة!\n[$Filename]"
DictVersinTooOld="[$Filename]\nالإصدار الحالي من القاموس ([$DictVer]) قديم جدا، فالرجاء تحديثه.\n\nهل تود زيارة موقع Lingoes على ويب للبحث عن الإصدار الأخير؟"
DictVersinTooNew="[$Filename]\nالإصدار الحالي من القاموس ([$DictVer]) يحتاج إلى إصدار أحدث من Lingoes.\n\nهل تود الآن تحميل الإصدار الأخير من موقع Lingoes على ويب؟"

AskDictRepeatInstall="لائحة القواميس تحتوي على القاموس \"[$DictTitle]\",\nهل تود المتابعة؟"
InstallDictFail="فشل في تثبيت القاموس:\n[$Filename]"
AskUninstall="هل تود بالفعل إلغاء تثبيت القاموس؟\n\n[$DictTitle]\nID: [$DictID]"
UninstallDictFail="فشل في إلغاء تثبيت القاموس\n\n[$DictTitle]\nID: [$DictID]"
AskRemoveFromGroup="هل تود بالفعل إزالة القاموس \"[$DictTitle]\" الموجود في اللائحة؟"

MemoryAllocFail="فشل في حجز مكان في الذاكرة."
FilenameInvalid="إسم ملف غير شرعي."
SaveFileFail="فشل في حفظ الملف"
OpenFileFail="فشل في فتح الملف"

AreYouAbort="هل تود بالفعل إلغاء العملية الحالية؟"
CreateThreadFail="فشل في إنشاء مسار للمعالجة"
CreateEventFail="فشل في إنشاء مقبض للحدث"
Unfulfilment="الميزة لم تكتمل بعد"
OnlyProVersion="هذه الميزة هي للإصدار الإحترافي فقط."
NoRegister="الإصدار غير مسجَّل، فالرجاء تسجيل Lingoes لتتمكن من إستخدام الميزة."
UsernameIsEmpty="إسم المستخدم فارغ، فالرجاء ملأه مرة أخرى."
SaveSearchResultFail="فشل في حفظ نتيجة البحث."

OpenAppendixFail="فشل في فتح محتويات الملحق."
OpenSpeechEngineFail="فشل في تحميل محرك نص إلى كلام (TTS)، فالرجاء فحص ما إذا كان TTS مثبَّتا في النظام \n\nيجب تثبيت محرك TTS في نظام التشغيل ليتم النطق. إن لم يكن كذلك، فالرجاء تحميله من موقع Lingoes على ويب وتثبيته \n\nهل تود تحميله الآن"

; NeedIE6Support="Lingoes يتطلب الإصدار السادس أو أعلى من Internet Explorer، فالرجاء تحديث متصفحك إلى هذا الإصدار"
NoImplement="للأسف، الميزة لم تكتمل بعد"
